[{"displayName":"name1","age":10,"password":"a","username":"a","biography":"a test user but lazy","interests":[],"SavedRecipes":[{"instructions":"Combine all the ingredients in a bowl and mix well. Use immediately, or store for up to 2 weeks in a tightly sealed container in the refrigerator. Shake or stir well before using.","ingredients":"[\u00272 tablespoons water\u0027, \u00272 tablespoons rice vinegar\u0027, \u00276 tablespoons soy sauce\u0027, \u00271 tablespoon gochugaru (Korean red chili flakes)\u0027, \u00272 garlic cloves, minced\u0027, \u0027.25 teaspoon minced ginger\u0027, \u00271 teaspoon toasted sesame oil\u0027, \u0027Sliced fresh red chile, optional\u0027]","genre":["Sauce","Korean"],"name":"Pajeon Sauce","rating":0,"ID":119,"image":"pajeon-sauce","preptime":0},{"instructions":"Make the mango hot sauce: Heat the oil in a medium pan over low heat. Add the shallots, chiles, garlic, turmeric, and mango and saute for 5 to 7 minutes, until the aromatics start to soften. Add the salt, vinegar, and .5 cup water. Stir to combine, then cover and simmer until the aromatics are completely softened and the liquid thickens slightly, about 10 minutes.\nTransfer the mixture to a blender and blend until smooth. Stir in the orange juice and season with more salt to taste. Transfer the hot sauce to a resealable glass jar and refrigerate until ready to use. (The hot sauce will keep for up to 2 weeks.)\nMake the lime sour cream: In a medium bowl, stir together the sour cream, lime zest and juice, and salt. Refrigerate until ready to serve.\nMake the plantains: Fill a large Dutch oven or heavy-bottomed pot about two-thirds of the way with vegetable oil. Heat over medium heat until the oil reaches 375F.\nWith a very sharp knife, peel the plantains, then slice lengthwise about  inch thick. Working in batches, fry the plantains in the hot oil, flipping occasionally, until golden brown on both sides, 4 to 6 minutes. Using a slotted spoon, transfer to a paper towellined plate to drain. Season with salt and pepper.\nServe the fried plantains with the mango hot sauce and lime sour cream for dipping.","ingredients":"[\u00272 tablespoons sunflower oil or other neutral oil\u0027, \u00274 medium shallots, finely chopped\u0027, \u00273 Scotch Bonnet chiles, or to taste, cored, seeded, and finely chopped (see Note)\u0027, \u00273 garlic cloves, chopped\u0027, \u00271 (.25-inch) piece fresh turmeric, peeled and finely chopped, or 1 teaspoon ground turmeric\u0027, \u0027.25 cup chopped fresh mango\u0027, \u0027.25 teaspoon sea salt, plus more to taste\u0027, \u0027.25 cup sugarcane vinegar or apple cider vinegar\u0027, \u0027.25 cup orange juice\u0027, \u00271 cup sour cream\u0027, \u0027.5 teaspoon lime zest\u0027, \u00271 tablespoon fresh lime juice\u0027, \u00271 teaspoon sea salt\u0027, \u0027Vegetable oil, for frying\u0027, \u00276 green plantains\u0027, \u0027Sea salt and freshly ground black pepper\u0027]","genre":["Snack","Latin American","Fusion","Vegetarian"],"name":"Fried Plantain Chips With Lime Sour Cream and Mango Hot Sauce","rating":0,"ID":156,"image":"fried-plantain-chips-with-lime-sour-cream-and-mango-hot-sauce","preptime":0},{"instructions":"Put all of the ingredients except the oil in a blender. Blend on high. After the ingredients are blended, slowly add the oil and continue to blend until the mixture is thickened and emulsified. (Makes 1 cup.)\nHeat a grill pan to medium-high heat. Drizzle the watermelon slices with just enough oil to thinly coat and place them on the hot grill.\nGrill each side of the watermelon slices for about 2 minutes, until charred. Transfer to a plate and season with salt.\nRemove the rind and dice the grilled watermelon into large cubes.\nPreheat the oven to 350F. Toss the pumpkin seeds with the cayenne, sugar, and 2 teaspoons oil and place on a small baking sheet. Roast for 6 to 10 minutes, until golden.\nBrush the cornbread cubes with the melted butter and place in a single layer on a baking sheet. Put in the oven along with the pumpkin seeds and bake for 10 minutes, turning halfway with a flexible spatula. Remove from the oven when the croutons are toasted and golden.\nToss the watermelon, shiso, dates, and chile in the bowl with .25 cup Lime Mango Dressing (reserve remaining dressing for another use). Taste and adjust the seasoning with salt and pepper. Add the cornbread croutons and toss very gently to combine without breaking the croutons. Spoon the salad onto a large platter and garnish with the pumpkin seeds and cheese.","ingredients":"[\u0027.5 cup coarsely chopped ripe mango\u0027, \u0027.25 cup fresh lime juice\u0027, \u0027.25 cup dry sake\u0027, \u00272 tablespoons champagne vinegar\u0027, \u00271 teaspoon minced seeded birds-eye chile\u0027, \u0027.5 teaspoon kosher salt\u0027, \u0027.25 cup canola oil\u0027, \u00273 pounds seedless watermelon, peel left on, cut into 1-inch-thick slabs\u0027, \u0027Olive oil\u0027, \u0027Kosher salt\u0027, \u0027.5 cup hulled pumpkin seeds\u0027, \u0027.25 teaspoon ground cayenne\u0027, \u00271 teaspoon sugar\u0027, \u00274 cups 1-inch cubes homemade or store-bought cornbread\u0027, \u00272 tablespoons unsalted butter, melted\u0027, \u00278 fresh shiso leaves, shredded (or Thai basil or mint)\u0027, \u0027.5 cup dates, pitted and chopped\u0027, \u00271 serrano chile, sliced into rings\u0027, \u0027Freshly ground black pepper\u0027, \u0027.5 cup ricotta or mascarpone\u0027]","genre":["Meal","Soul"],"name":"Grilled Watermelon Salad With Lime Mango Dressing and Cornbread Croutons","rating":0,"ID":155,"image":"grilled-watermelon-salad-with-lime-mango-dressing-and-cornbread-croutons","preptime":0}],"UserReviews":{"119":{"reviewID":0,"recipeID":119,"username":"a","comments":"hi","rating":3},"155":{"reviewID":0,"recipeID":155,"username":"a","comments":"hi","rating":2},"156":{"reviewID":0,"recipeID":156,"username":"a","comments":"fd","rating":2}},"GenreWeights":{"Soul":0.05,"Sauce":0.05,"Latin American":0.05,"Vegetarian":0.05,"Meal":0.05,"Korean":0.05,"Snack":0.05,"Fusion":0.05}},{"displayName":"test again","age":4,"password":"b","username":"b","biography":"hello","interests":["Coleslaw","Alcohol"],"SavedRecipes":[],"UserReviews":{},"GenreWeights":{"Coleslaw":0.7,"Alcohol":0.7}},{"displayName":"name2","age":10,"password":"password2","username":"username2","biography":"a test user but double","interests":["German","French"],"SavedRecipes":[],"UserReviews":{},"GenreWeights":{}},{"displayName":"name1","age":10,"password":"password1","username":"username1","biography":"a test user","interests":["German","Italian"],"SavedRecipes":[],"UserReviews":{},"GenreWeights":{}}]